app/controllers/contacts_controller.rb

INSERT INTO "contacts" ("name", "phone", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Alan"], ["phone", "21 9-8311-0498"], ["created_at", "2022-08-12 00:36:04.457511"], ["updated_at", "2022-08-12 00:36:04.457511"]]
---
  def create
    @contact = Contact.new(contact_params)

    respond_to do |format|
      if @contact.save

SELECT "contacts".* FROM "contacts" WHERE "contacts"."user_id" = $1 AND "contacts"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 4], ["LIMIT", 1]]
---
    def set_contact
      #@contact = Contact.find(params[:id])
      @contact = current_user.contacts.find(params[:id])