app/controllers/users_controller.rb

INSERT INTO "users" ("email", "name", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["email", "thelaconic.music@gmail.com"], ["name", "Laconic"], ["password_digest", "[FILTERED]"], ["created_at", "2022-08-12 01:41:27.254625"], ["updated_at", "2022-08-12 01:41:27.254625"]]
---
    def create
        @user = User.new(user_params)
        if @user.save